src/main/java/company/vk/edu/distrib/compute/kruchinina/sharding/load_testing/consistent_hashing.txt
Running 30s test @ http://localhost:8001
  2 threads and 100 connections
  Thread calibration: mean lat.: 7.916ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 8.613ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.48ms    4.30ms  47.14ms   91.18%
    Req/Sec    99.80     99.16   341.00     78.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.06ms
 75.000%    3.51ms
 90.000%    7.01ms
 99.000%   23.17ms
 99.900%   39.10ms
 99.990%   47.17ms
 99.999%   47.17ms
100.000%   47.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.277     0.000000            1         1.00
       1.082     0.100000          390         1.11
       1.351     0.200000          781         1.25
       1.593     0.300000         1171         1.43
       1.829     0.400000         1560         1.67
       2.061     0.500000         1951         2.00
       2.227     0.550000         2145         2.22
       2.427     0.600000         2343         2.50
       2.671     0.650000         2537         2.86
       3.039     0.700000         2730         3.33
       3.505     0.750000         2925         4.00
       3.829     0.775000         3023         4.44
       4.231     0.800000         3121         5.00
       4.671     0.825000         3219         5.71
       5.323     0.850000         3316         6.67
       6.095     0.875000         3413         8.00
       6.523     0.887500         3462         8.89
       7.007     0.900000         3510        10.00
       7.903     0.912500         3559        11.43
       8.799     0.925000         3608        13.33
       9.791     0.937500         3657        16.00
      10.591     0.943750         3681        17.78
      11.495     0.950000         3706        20.00
      12.159     0.956250         3730        22.86
      13.351     0.962500         3754        26.67
      14.495     0.968750         3779        32.00
      15.447     0.971875         3791        35.56
      16.119     0.975000         3803        40.00
      16.959     0.978125         3815        45.71
      17.903     0.981250         3827        53.33
      20.063     0.984375         3840        64.00
      20.751     0.985938         3846        71.11
      21.695     0.987500         3852        80.00
      22.783     0.989062         3858        91.43
      24.927     0.990625         3865       106.67
      25.855     0.992188         3870       128.00
      27.551     0.992969         3873       142.22
      28.335     0.993750         3876       160.00
      28.847     0.994531         3879       182.86
      30.175     0.995313         3882       213.33
      30.703     0.996094         3885       256.00
      31.055     0.996484         3888       284.44
      31.055     0.996875         3888       320.00
      31.407     0.997266         3890       365.71
      31.503     0.997656         3891       426.67
      35.743     0.998047         3893       512.00
      36.415     0.998242         3894       568.89
      36.415     0.998437         3894       640.00
      38.367     0.998633         3895       731.43
      39.103     0.998828         3896       853.33
      39.263     0.999023         3897      1024.00
      39.263     0.999121         3897      1137.78
      39.263     0.999219         3897      1280.00
      43.103     0.999316         3898      1462.86
      43.103     0.999414         3898      1706.67
      44.063     0.999512         3899      2048.00
      44.063     0.999561         3899      2275.56
      44.063     0.999609         3899      2560.00
      44.063     0.999658         3899      2925.71
      44.063     0.999707         3899      3413.33
      47.167     0.999756         3900      4096.00
      47.167     1.000000         3900          inf
#[Mean    =        3.484, StdDeviation   =        4.301]
#[Max     =       47.136, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 565.01KB read
  Non-2xx or 3xx responses: 2016
Requests/sec:    200.04
Transfer/sec:     18.83KB