src/main/java/company/vk/edu/distrib/compute/kruchinina/sharding/load_testing/rendezvous_hashing.txt
Running 30s test @ http://localhost:8001
  2 threads and 100 connections
  Thread calibration: mean lat.: 19.699ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 12.439ms, rate sampling interval: 49ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.42ms    2.66ms  40.70ms   92.70%
    Req/Sec    99.44     94.88   346.00     34.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.74ms
 75.000%    2.56ms
 90.000%    4.17ms
 99.000%   13.26ms
 99.900%   30.94ms
 99.990%   40.74ms
 99.999%   40.74ms
100.000%   40.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.216     0.000000            1         1.00
       0.887     0.100000          392         1.11
       1.140     0.200000          782         1.25
       1.337     0.300000         1174         1.43
       1.538     0.400000         1562         1.67
       1.736     0.500000         1952         2.00
       1.853     0.550000         2147         2.22
       1.982     0.600000         2345         2.50
       2.131     0.650000         2537         2.86
       2.293     0.700000         2734         3.33
       2.555     0.750000         2927         4.00
       2.715     0.775000         3025         4.44
       2.911     0.800000         3122         5.00
       3.117     0.825000         3221         5.71
       3.389     0.850000         3318         6.67
       3.701     0.875000         3415         8.00
       3.945     0.887500         3464         8.89
       4.171     0.900000         3512        10.00
       4.439     0.912500         3561        11.43
       4.915     0.925000         3610        13.33
       5.599     0.937500         3659        16.00
       5.959     0.943750         3683        17.78
       6.395     0.950000         3707        20.00
       6.919     0.956250         3732        22.86
       7.683     0.962500         3756        26.67
       8.551     0.968750         3782        32.00
       8.943     0.971875         3793        35.56
       9.431     0.975000         3806        40.00
      10.311     0.978125         3817        45.71
      10.871     0.981250         3829        53.33
      11.727     0.984375         3842        64.00
      11.983     0.985938         3848        71.11
      12.399     0.987500         3854        80.00
      12.903     0.989062         3860        91.43
      13.415     0.990625         3866       106.67
      15.263     0.992188         3872       128.00
      16.991     0.992969         3875       142.22
      17.503     0.993750         3878       160.00
      18.095     0.994531         3881       182.86
      18.575     0.995313         3884       213.33
      19.471     0.996094         3887       256.00
      20.239     0.996484         3889       284.44
      20.623     0.996875         3890       320.00
      22.447     0.997266         3892       365.71
      23.487     0.997656         3893       426.67
      27.775     0.998047         3895       512.00
      28.463     0.998242         3896       568.89
      28.463     0.998437         3896       640.00
      28.495     0.998633         3897       731.43
      30.943     0.998828         3898       853.33
      34.303     0.999023         3899      1024.00
      34.303     0.999121         3899      1137.78
      34.303     0.999219         3899      1280.00
      35.039     0.999316         3900      1462.86
      35.039     0.999414         3900      1706.67
      36.319     0.999512         3901      2048.00
      36.319     0.999561         3901      2275.56
      36.319     0.999609         3901      2560.00
      36.319     0.999658         3901      2925.71
      36.319     0.999707         3901      3413.33
      40.735     0.999756         3902      4096.00
      40.735     1.000000         3902          inf
#[Mean    =        2.421, StdDeviation   =        2.660]
#[Max     =       40.704, Total count    =         3902]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.01s, 558.76KB read
  Non-2xx or 3xx responses: 1940
Requests/sec:    200.02
Transfer/sec:     18.62KB